{
	"name": "crear-emoji",
	"description": "Sube un emoji al servidor",
	"optionsEmojiName": "emoji",
	"optionsEmojiDescription": "El emoji a volver a subir",
	"optionsFileName": "archivo",
	"optionsFileDescription": "El archivo a cargar",
	"optionsNameName": "nombre",
	"optionsNameDescription": "El nombre a usar para el emoji",
	"missingPermissions": "No puedo subir tus emoji porque no tengo el permiso `Gestionar Emojis y Stickers`. Por favor, concédame este permiso y vuelve a intentarlo.",
	"duplicated": "Has subido un emoji y un archivo, por favor envíe sólo uno.",
	"none": "No has subido un emoji o un archivo, por favor envíe alguno de ellos.",
	"invalidName": "El nombre debe tener entre 2 y 32 caracteres, y solo contener: `0` a `9`, `a` a `z` con mayúsculas, o `_`.",
	"invalidDiscordURL": "La URL que has proporcionado no coincide con el patrón requerido (`https://cdn.discordapp. om/emojis/{emoji_id}.{format}`). Por favor, asegúrese de que estás usando una URL válida del CDN de Discord.",
	"notAnImage": "El archivo que usted subió no es una imagen, por lo que no se puede usar.",
	"failedToDownload": "No pude descargar el archivo. Si usted envió un emoji, por favor asegúrese de que es válido.",
	"uploaded": "He subido {{emoji}} con éxito.",
	"uploadedBy": "Subida de archivo autorizado por {{user.username}} ({{user.id}})",
	"failedToUpload": "No he podido subir el emoji, ¡disculpa por las molestias!",
	"failedToUploadDiscordDown": "Parece que Discord no se está sintiendo bien. Por favor, inténtelo de nuevo más tarde.",
	"failedToUploadMissingPermissions": "No he podido subir los emojis porque no tengo permiso para subir emojis. Por favor, concédemelo y reintente.",
	"failedToUploadInvalidBody": "Parece que no he subido el emoji correctamente, por favor inténtalo de nuevo.",
	"failedToUploadMaximumEmojis": "No he podido subir el emoji porque este servidor ya ha alcanzado el límite de emojis. Por favor, elimine uno y vuelva a intentarlo.",
	"failedToUploadMaximumAnimatedEmojis": "No he podido subir el emoji porque este servidor ya ha alcanzado el límite de emojis animados. Por favor, elimine uno y vuelva a intentarlo.",
	"contentLengthMissing": "El servidor desde el que he consultado el archivo parece estar mal configurado y se me ha olvidado decirme cuán grande es el archivo.",
	"contentLengthInvalid": "El servidor desde el que consulté el archivo me envió un tamaño de archivo no válido.",
	"contentLengthTooBig": "El archivo que has subido es demasiado grande (>256 kilobytes) y no se puede subir, por favor inténtalo de nuevo con una imagen más pequeña.",
	"contentTypeMissing": "El servidor desde el que he consultado el archivo parece estar mal configurado y se olvidó indicar el tipo del archivo.",
	"contentTypeUnsupported": "El archivo que usted ha subido no parece ser un formato de imagen compatible."
}
