{
	"name": "reddit",
	"description": "Provee información de Reddit",
	"subredditName": "subreddit",
	"subredditDescription": "Obtiene una publicación aleatoria de un subreddit especificado",
	"postName": "publicación",
	"postDescription": "Obtiene la información de un post específico",
	"optionsRedditName": "reddit",
	"optionsRedditDescription": "El nombre del subreddit del que obtener una publicación aleatoria",
	"optionsPostName": "publicación",
	"optionsPostDescription": "Enlace a una publicación de reddit",
	"invalidName": "Los subreddits debe tener entre 3 y 21 caracteres, y contener solo letras, números o guiones bajos. Los prefijos `/r/` y `r/` también son compatibles.",
	"invalidPostKey": "Las publicaciones deben tener una clave de al menos 6 caracteres, y solo letras y números.",
	"banned": "El subreddit especificado no se considera seguro, por favor pruebe con otro.",
	"post": "**{{title}}** publicado por {{author}}\n{{url}}",
	"noPosts": "No hay mensajes disponibles en el subreddit especificado. Por favor, asegúrese de que ha escrito el nombre correctamente.",
	"allNsfw": "Todos los mensajes del subreddit especificado están marcados como NSFW, los cuales solo se pueden mostrar en canales restringidos por edad.",
	"allNsfl": "Todos los mensajes del subreddit especificado están marcados como NSFL, por lo que no puedo mostrarlos.",
	"abortError": "Reddit no respondió a tiempo, por favor inténtelo de nuevo más tarde.",
	"parsePostException": "No pude analizar los datos de la publicación especificada.",
	"unavailableErrorPrivate": "No pude obtener ninguna información del subreddit especificado porque está marcado como privado.",
	"unavailableErrorGoldOnly": "No pude obtener ninguna información del subreddit especificado porque está marcado como exclusivo para Reddit Premium.",
	"unavailableErrorQuarantined": "No pude obtener ninguna información del subreddit especificado porque está en cuarentena. Motivo:\n>>> {{reason}}",
	"unavailableErrorGated": "No pude obtener ninguna información del subreddit especificado porque está cerrado. Motivo:\n>>> {{reason}}",
	"unavailableErrorNotFound": "No pude obtener ninguna información del subreddit especificado porque no existe.",
	"unavailableErrorBanned": "No pude obtener ninguna información del subreddit especificado porque está marcado como prohibido.",
	"unavailableForLegalReasons": "No pude obtener ninguna información del subreddit especificado porque no está disponible por razones legales.",
	"unavailable": "No pude obtener ninguna información de Reddit porque sus servidores no están disponibles actualmente.",
	"unknownError": "No pude obtener ninguna información del subreddit especificado debido a un error desconocido."
}
