{
	"name": "इमोजी-बनाएं",
	"description": "सर्वर पर एक इमोजी अपलोड करता है",
	"optionsEmojiName": "इमोजी",
	"optionsEmojiDescription": "पुनः अपलोड करने के लिए इमोजी",
	"optionsFileName": "फ़ाइल",
	"optionsFileDescription": "अपलोड करने हेतु फाइल",
	"optionsNameName": "नाम",
	"optionsNameDescription": "इमोजी के लिए उपयोग किया जाने वाला नाम",
	"missingPermissions": "मैं आपका इमोजी अपलोड नहीं कर सकता क्योंकि मेरे पास `इमोजी और स्टिकर मैनेज करें` की अनुमति नहीं है। कृपया मुझे यह अनुमति दें और इसे पुनः प्रयास करें।",
	"duplicated": "आपने इमोजी और फ़ाइल दोनों अपलोड किए हैं, कृपया केवल एक ही भेजें।",
	"none": "आपने न तो कोई इमोजी अपलोड किया है और न ही कोई फ़ाइल, कृपया उनमें से कोई भेजें।",
	"invalidName": "नाम 2 और 32 वर्णों के बीच होना चाहिए, और केवल इसमें शामिल होना चाहिए: `0` से `9`, `a` से `z` बड़े अक्षरों के साथ, या `_`।",
	"invalidDiscordURL": "आपके द्वारा प्रदान किया गया यूआरएल आवश्यक पैटर्न (`https://cdn.discordapp.com/emojis/{emoji_id}.{format}`) से मेल नहीं खाता है। कृपया सुनिश्चित करें कि आप इमोजी के लिए वैध Discord CDN यूआरएल का उपयोग कर रहे हैं।",
	"notAnImage": "आपके द्वारा अपलोड की गई फ़ाइल छवि नहीं है, इसलिए इसे अपलोड नहीं किया जा सकता।",
	"failedToDownload": "मैं फ़ाइल डाउनलोड करने में असमर्थ था। यदि आपने कोई इमोजी भेजा है, तो कृपया सुनिश्चित करें कि यह मान्य है।",
	"uploaded": "मैंने सफलतापूर्वक {{emoji}} अपलोड कर दिया है।",
	"uploadedBy": "{{user.username}} ({{user.id}}) द्वारा प्राधिकृत फ़ाइल अपलोड",
	"failedToUpload": "मैं इमोजी अपलोड करने में विफल रहा, असुविधा के लिए खेद है!",
	"failedToUploadDiscordDown": "ऐसा लगता है कि डिस्कोर्ड अच्छा महसूस नहीं कर रहा है। कृपया बाद में पुन: प्रयास करें।",
	"failedToUploadMissingPermissions": "मैं इमोजी अपलोड करने में विफल रहा क्योंकि मेरे पास इमोजी अपलोड करने की अनुमति नहीं है। कृपया इसे प्रदान करें और पुनः प्रयास करें।",
	"failedToUploadInvalidBody": "ऐसा लगता है कि मैंने इमोजी को सही तरीके से अपलोड नहीं किया, कृपया बाद में पुनः प्रयास करें।",
	"failedToUploadMaximumEmojis": "मैं इमोजी अपलोड करने में विफल रहा क्योंकि यह सर्वर पहले ही इमोजी की सीमा तक पहुंच चुका है। कृपया एक निकालें और पुन: प्रयास करें।",
	"failedToUploadMaximumAnimatedEmojis": "मैं इमोजी अपलोड करने में विफल रहा क्योंकि यह सर्वर पहले ही एनिमेटेड इमोजी की सीमा तक पहुंच चुका है। कृपया एक निकालें और पुन: प्रयास करें।",
	"contentLengthMissing": "जिस सर्वर से मैंने फ़ाइल की क्वेरी की थी, वह गलत प्रतीत होता है और मुझे यह बताना भूल गया कि फ़ाइल कितनी बड़ी है।",
	"contentLengthInvalid": "जिस सर्वर से मैंने फ़ाइल की क्वेरी की थी, उसने मुझे एक अमान्य फ़ाइल आकार भेजा था।",
	"contentLengthTooBig": "आपके द्वारा अपलोड की गई फ़ाइल बहुत बड़ी है (>256 किलोबाइट) और अपलोड नहीं की जा सकती, कृपया छोटी छवि के साथ पुन: प्रयास करें।",
	"contentTypeMissing": "जिस सर्वर से मैंने फ़ाइल की क्वेरी की थी वह गलत कॉन्फ़िगर किया गया प्रतीत होता है और मुझे फ़ाइल का प्रकार बताना भूल गया।",
	"contentTypeUnsupported": "आपके द्वारा अपलोड की गई फ़ाइल समर्थित छवि प्रारूप प्रतीत नहीं होती|"
}
