{
	"name": "रेड्डिट",
	"description": "रेड्डिट से जानकारी प्राप्त करें",
	"optionsRedditName": "रेड्डिट",
	"optionsRedditDescription": "सबरेड्डिट से एक पोस्ट प्राप्त करें",
	"invalidName": "सबरेड्डिट 3 और 21 वर्णों के बीच लंबा होना चाहिए, और इसमें केवल अक्षर, संख्याएँ या अंडरस्कोर होने चाहिए। इसके अतिरिक्त, `/r/` और `r/` उपसर्ग भी समर्थित हैं।",
	"banned": "निर्दिष्ट सबरेड्डिट को सुरक्षित नहीं माना जाता है, कृपया दूसरा प्रयास करें।",
	"post": "**{{title}}** {{author}} द्वारा प्रस्तुत\n{{url}}",
	"noPosts": "निर्दिष्ट सबरेड्डिट में कोई पोस्ट उपलब्ध नहीं है। कृपया सुनिश्चित करें कि आपने नाम सही टाइप किया है।",
	"nsfwFailedToFetchChannel": "मैं निर्धारित नहीं कर सका कि यह चैनल उम्र-प्रतिबंधित है या नहीं। कृपया बाद में पुन: प्रयास करें।",
	"allNsfw": "निर्दिष्ट सबरेडिट से सभी पोस्ट NSFW के रूप में चिह्नित हैं, जो केवल उम्र-प्रतिबंधित चैनल चैनलों पर प्रदर्शित की जा सकती हैं।",
	"allNsfl": "निर्दिष्ट सबरेड्डिट से सभी पोस्ट NSFL के रूप में चिह्नित हैं, और इसलिए, मैं उनमें से कोई भी आपको नहीं दिखा सकता।",
	"abortError": "रेड्डिट ने समय पर प्रतिक्रिया नहीं दी, कृपया बाद में पुनः प्रयास करें।",
	"unavailableErrorPrivate": "मैं निर्दिष्ट सबरेड्डिट से कोई जानकारी प्राप्त नहीं कर सका क्योंकि इसे निजी के रूप में चिह्नित किया गया है।",
	"unavailableErrorGoldOnly": "I couldn't get any information from the specified subreddit because it's marked as Reddit Premium only.",
	"unavailableErrorQuarantined": "मुझे निर्दिष्ट सबरेड्डिट से कोई जानकारी नहीं मिल सकी क्योंकि यह क्वारंटाइन है। कारण:\n>>> {{reason}}",
	"unavailableErrorGated": "मुझे निर्दिष्ट सबरेड्डिट से कोई जानकारी नहीं मिल सकी क्योंकि यह गेटेड है। कारण:\n>>> {{reason}}",
	"unavailableErrorNotFound": "मुझे निर्दिष्ट सबरेड्डिट से कोई जानकारी नहीं मिली क्योंकि यह मौजूद नहीं है।",
	"unavailableErrorBanned": "मुझे निर्दिष्ट सबरेड्डिट से कोई जानकारी नहीं मिल सकी क्योंकि इसे प्रतिबंधित के रूप में चिह्नित किया गया है।",
	"unavailableForLegalReasons": "मुझे निर्दिष्ट सबरेड्डिट से कोई जानकारी नहीं मिल सकी क्योंकि यह कानूनी कारणों से अनुपलब्ध है।",
	"unavailable": "मुझे रेड्डिट से कोई जानकारी नहीं मिल सकी क्योंकि उनके सर्वर फ़िलहाल अनुपलब्ध हैं।",
	"unknownError": "अज्ञात त्रुटि के कारण मुझे निर्दिष्ट सबरेड्डिट से कोई जानकारी नहीं मिल सकी।"
}
