{
	"name": "creëer-emoji",
	"description": "Upload een emoji naar de server",
	"optionsEmojiName": "emoji",
	"optionsEmojiDescription": "De emoji om te heruploaden",
	"optionsFileName": "bestand",
	"optionsFileDescription": "Het bestand om te uploaden",
	"optionsNameName": "naam",
	"optionsNameDescription": "De naam die moet worden gebruikt voor de emoji",
	"missingPermissions": "Ik kan je emoji niet uploaden omdat ik de machtiging \"Beheer emoji's en stickers\" niet heb. Geef me deze machtiging en probeer het opnieuw.",
	"duplicated": "Je hebt zowel een emoji als een bestand geüpload, stuur er alsjeblieft maar één van de twee.",
	"none": "Je hebt geen emoji noch bestand geüpload, stuur er alsjeblieft één van de twee.",
	"invalidName": "De naam moet tussen 2 en 32 tekens lang zijn en alleen bevatten: `0` tot `9`, `a` tot `z` met hoofdletters, of `_`.",
	"invalidDiscordURL": "De URL die u hebt opgegeven komt niet overeen met het vereiste patroon (`https://cdn.discordapp. om/emojis/{emoji_id}.{format}`). Zorg ervoor dat je een geldige Discord CDN URL gebruikt voor een emoji.",
	"notAnImage": "Het bestand dat je hebt geüpload is geen afbeelding, daarom kan het niet worden geüpload.",
	"failedToDownload": "Ik kon het bestand niet downloaden. Als je een emoji hebt verzonden, zorg er dan voor dat het een geldige emoji is.",
	"uploaded": "Ik heb {{emoji}} succesvol geüpload.",
	"uploadedBy": "Uploaden van bestanden toegestaan door {{user.username}} ({{user.id}})",
	"failedToUpload": "Het is niet gelukt om de emoji te uploaden, excuus voor het ongemak!",
	"failedToUploadDiscordDown": "Het lijkt erop dat Discord zich niet goed voelt. Probeer het later opnieuw.",
	"failedToUploadMissingPermissions": "Het is niet gelukt om de emoji te uploaden omdat ik geen toestemming heb om emoji te uploaden. Sta het toe en probeer het opnieuw.",
	"failedToUploadInvalidBody": "Het lijkt erop dat ik de emoji niet correct heb geüpload, probeer het later opnieuw.",
	"failedToUploadMaximumEmojis": "Het is niet gelukt om de emoji te uploaden omdat deze server het emoji limiet heeft bereikt. Verwijder er één en probeer het opnieuw.",
	"failedToUploadMaximumAnimatedEmojis": "Het is niet gelukt om de emoji te uploaden omdat deze server het geanimeerde emoji limiet al heeft bereikt. Verwijder er één en probeer het opnieuw.",
	"contentLengthMissing": "De server waar ik naar heb gevraagd lijkt verkeerd geconfigureerd te zijn en vergat me te vertellen hoe groot het bestand is.",
	"contentLengthInvalid": "De server die ik heb aangevraagd heeft mij een ongeldige bestandsgrootte gestuurd.",
	"contentLengthTooBig": "Het bestand dat je hebt geüpload is te groot (>256 kilobytes) en kan niet worden geüpload, probeer het opnieuw met een kleinere afbeelding.",
	"contentTypeMissing": "De server die ik heb aangevraagd lijkt verkeerd geconfigureerd te zijn en vergat me het type van het bestand te vertellen.",
	"contentTypeUnsupported": "Het bestand dat je hebt geüpload lijkt geen ondersteund afbeeldingsformaat te zijn."
}
