{
	"name": "reddit",
	"description": "Haal informatie van Reddit op",
	"optionsRedditName": "reddit",
	"optionsRedditDescription": "De subreddit om een bericht van op te halen",
	"invalidName": "Subreddits moeten tussen 3 en 21 tekens lang zijn en mogen alleen letters, cijfers of liggende streepjes bevatten. Verder worden de `/r/` en `r/` voorvoegsels ook ondersteund.",
	"banned": "De opgegeven subreddit wordt niet veilig geacht, probeer een andere.",
	"post": "**{{title}}** ingediend door {{author}}\n{{url}}",
	"noPosts": "Er zijn geen berichten beschikbaar in de opgegeven subreddit. Controleer of je de naam correct hebt ingevoerd.",
	"nsfwFailedToFetchChannel": "Ik kon niet bepalen of dit kanaal leeftijdgebonden is. Probeer het later opnieuw.",
	"allNsfw": "Alle berichten van de opgegeven subreddit zijn gemarkeerd als NSFW, die alleen kan worden weergegeven op leeftijd-beperkte kanalen.",
	"allNsfl": "Alle posts van de gespecificeerde subreddit zijn gemarkeerd als NSFL, daarom kan ik geen van hen tonen.",
	"abortError": "Reddit heeft niet op tijd gereageerd, probeer het later opnieuw.",
	"unavailableErrorPrivate": "Ik kon geen informatie krijgen van de opgegeven subreddit omdat het gemarkeerd is als privé.",
	"unavailableErrorGoldOnly": "Ik kon geen informatie van de opgegeven subreddit krijgen omdat deze gemarkeerd is als alleen toegang voor Reddit Premium.",
	"unavailableErrorQuarantined": "Ik kon geen informatie krijgen van de opgegeven subreddit omdat deze verbannen is. Reden:\n>>> {{reason}}",
	"unavailableErrorGated": "Ik kon geen informatie ophalen van de opgegeven subreddit omdat deze geblokkeerd is. Reden:\n>>> {{reason}}",
	"unavailableErrorNotFound": "Ik kon geen informatie van de opgegeven subreddit krijgen omdat deze niet bestaat.",
	"unavailableErrorBanned": "Ik kon geen informatie van de opgegeven subreddit krijgen omdat deze gemarkeerd is als verbannen.",
	"unavailableForLegalReasons": "Ik kon geen informatie krijgen van de opgegeven subreddit omdat het om juridische redenen niet beschikbaar is.",
	"unavailable": "Ik kon geen informatie van Reddit krijgen omdat hun servers momenteel niet beschikbaar zijn.",
	"unknownError": "Ik kon geen informatie van de opgegeven subreddit krijgen wegens een onbekende fout."
}
