{
	"name": "создать-эмодзи",
	"description": "Загружает эмодзи на сервер",
	"optionsEmojiName": "эмодзи",
	"optionsEmojiDescription": "Эмодзи для последующей загрузки",
	"optionsFileName": "файл",
	"optionsFileDescription": "Файл для загрузки",
	"optionsNameName": "название",
	"optionsNameDescription": "Название для эмодзи",
	"missingPermissions": "Я не могу загрузить ваш эмодзи из-за отсутствия права `Управлять эмодзи и стикерами`. Пожалуйста, предоставьте мне это право и повторите попытку.",
	"duplicated": "Вы загрузили и эмодзи, и файл. Пожалуйста, отправьте что-то одно.",
	"none": "Вы не загрузили ни эмодзи, ни файл. Пожалуйста, отправьте что-либо из них.",
	"invalidName": "Название должно иметь длину от 2 до 32 символов и содержать только цифры от `0` до `9`, заглавные и строчные буквы от `a` до `z`, знак подчёркивания `_`.",
	"notAnImage": "Отправленный вами файл не является изображением, поэтому он не может быть загружен.",
	"failedToDownload": "Мне не удалось скачать файл. Если вы отправили эмодзи, пожалуйста, убедитесь, что он является допустимым.",
	"uploaded": "Я успешно загрузил {{emoji}}.",
	"uploadedBy": "Загрузка файла авторизована {{user.username}} ({{user.id}})",
	"failedToUpload": "Мне не удалось загрузить эмодзи, простите за доставленные неудобства!",
	"failedToUploadDiscordDown": "Кажется, Discord не очень хорошо себя чувствует. Пожалуйста, повторите попытку позже.",
	"failedToUploadMissingPermissions": "Мне не удалось загрузить эмодзи, так как у меня нет права на их загрузку. Пожалуйста, предоставьте мне это право и повторите попытку.",
	"failedToUploadInvalidBody": "Похоже, мне не удалось правильно загрузить эмодзи. Пожалуйста, повторите попытку позже.",
	"failedToUploadMaximumEmojis": "Мне не удалось загрузить эмодзи, так как на этом сервере уже достигнут лимит эмодзи. Пожалуйста, удалите один и повторите попытку.",
	"failedToUploadMaximumAnimatedEmojis": "Мне не удалось загрузить эмодзи, так как на этом сервере уже достигнут лимит анимированных эмодзи. Пожалуйста, удалите один и повторите попытку.",
	"contentLengthMissing": "Похоже, что сервер, с которого я запросил файл, настроен неправильно, он забыл сообщить мне размер файла.",
	"contentLengthInvalid": "Сервер, с которого я запросил файл, отправил мне некорректный размер файла.",
	"contentLengthTooBig": "Отправленный вами файл слишком большой (>256 килобайт) и не может быть загружен. Пожалуйста, попробуйте отправить изображение меньшего размера.",
	"contentTypeMissing": "Похоже, что сервер, с которого я запросил файл, настроен неправильно, он забыл сообщить мне тип файла.",
	"contentTypeUnsupported": "Похоже, формат отправленного вами файла не является поддерживаемым форматом изображения."
}
