{
	"name": "создать-эмодзи",
	"description": "Загружает эмодзи на сервер",
	"optionsEmojiName": "эмодзи",
	"optionsEmojiDescription": "The emoji to re-upload",
	"optionsFileName": "файл",
	"optionsFileDescription": "Файл для загрузки",
	"optionsNameName": "название",
	"optionsNameDescription": "Название для эмодзи",
	"missingPermissions": "I cannot upload your emoji because I lack of the `Manage Emojis and Stickers` permission. Please grant this permission to me and retry this.",
	"duplicated": "You have uploaded both an emoji and a file, please send only one.",
	"none": "You have uploaded neither an emoji nor a file, please send any of them.",
	"invalidName": "Название должно иметь длину от 2 до 32 символов и содержать только цифры от `0` до `9`, заглавные и строчные буквы от `a` до `z`, знак подчёркивания `_`.",
	"notAnImage": "Отправленный вами файл не является изображением, поэтому он не может быть загружен.",
	"failedToDownload": "I was unable to download the file. If you have sent an emoji, please make sure it's a valid one.",
	"uploaded": "Я успешно загрузил {{emoji}}.",
	"uploadedBy": "Upload of file authorized by {{user.username}} ({{user.id}})",
	"failedToUpload": "Мне не удалось загрузить эмодзи, простите за доставленные неудобства!",
	"failedToUploadDiscordDown": "Кажется, Discord не очень хорошо себя чувствует. Пожалуйста, повторите попытку позже.",
	"failedToUploadMissingPermissions": "I failed to upload the emoji as I lack of the permission to upload emojis. Please grant it and retry.",
	"failedToUploadInvalidBody": "It seems I did not upload the emoji correctly, please try again later.",
	"failedToUploadMaximumEmojis": "I failed to upload the emoji because this server already reached the emoji limit. Please remove one and try again.",
	"failedToUploadMaximumAnimatedEmojis": "I failed to upload the emoji because this server already reached the animated emoji limit. Please remove one and try again.",
	"contentLengthMissing": "Похоже, что сервер, с которого я запросил файл, настроен неправильно, он забыл сообщить мне размер файла.",
	"contentLengthInvalid": "The server I queried the file from sent me an invalid file size.",
	"contentLengthTooBig": "The file you uploaded is too big (>256 kilobytes) and cannot be uploaded, please try again with a smaller image.",
	"contentTypeMissing": "Похоже, что сервер, с которого я запросил файл, настроен неправильно, он забыл сообщить мне тип файла.",
	"contentTypeUnsupported": "The file you uploaded does not seem to be a supported image format."
}
