{
	"name": "создать-эмодзи",
	"description": "Загружает эмодзи на сервер",
	"optionsEmojiName": "эмодзи",
	"optionsEmojiDescription": "The emoji to re-upload",
	"optionsFileName": "файл",
	"optionsFileDescription": "Файл для загрузки",
	"optionsNameName": "название",
	"optionsNameDescription": "Название для эмодзи",
	"missingPermissions": "I cannot upload your emoji because I lack of the `Manage Emojis and Stickers` permission. Please grant this permission to me and retry this.",
	"duplicated": "You have uploaded both an emoji and a file, please send only one.",
	"none": "You have uploaded neither an emoji nor a file, please send any of them.",
	"invalidName": "The name must be between 2 and 32 characters, and only contain: `0` to `9`, `a` to `z` with capitals, or `_`.",
	"notAnImage": "The file you uploaded is not an image, so it cannot be uploaded.",
	"failedToDownload": "I was unable to download the file. If you have sent an emoji, please make sure it's a valid one.",
	"uploaded": "Я успешно загрузил {{emoji}}.",
	"uploadedBy": "Upload of file authorized by {{user.username}} ({{user.id}})",
	"failedToUpload": "I failed to upload the emoji, sorry for the inconvenience!",
	"failedToUploadDiscordDown": "It seems Discord is not feeling well. Please try again later.",
	"failedToUploadMissingPermissions": "I failed to upload the emoji as I lack of the permission to upload emojis. Please grant it and retry.",
	"failedToUploadInvalidBody": "It seems I did not upload the emoji correctly, please try again later.",
	"failedToUploadMaximumEmojis": "I failed to upload the emoji because this server already reached the emoji limit. Please remove one and try again.",
	"failedToUploadMaximumAnimatedEmojis": "I failed to upload the emoji because this server already reached the animated emoji limit. Please remove one and try again.",
	"contentLengthMissing": "The server I queried the file from seems to be misconfigured and forgot to tell me how big the file is.",
	"contentLengthInvalid": "The server I queried the file from sent me an invalid file size.",
	"contentLengthTooBig": "The file you uploaded is too big (>256 kilobytes) and cannot be uploaded, please try again with a smaller image.",
	"contentTypeMissing": "The server I queried the file from seems to be misconfigured and forgot to tell me the type of the file.",
	"contentTypeUnsupported": "The file you uploaded does not seem to be a supported image format."
}
