{
	"name": "reddit",
	"description": "Получить информацию от Reddit",
	"optionsRedditName": "reddit",
	"optionsRedditDescription": "Сабреддит, с которого получить пост",
	"invalidName": "Сабреддиты должны быть длиной от 3 до 21 символов и содержать только буквы, цифры или подчеркивания. Кроме того, также поддерживаются префиксы `/r/` и `r/`.",
	"banned": "Указанный сабреддит не считается безопасным, пожалуйста, попробуйте другой.",
	"post": "**{{title}}** отправлен {{author}}\n{{url}}",
	"noPosts": "В указанном сабреддите нет постов. Пожалуйста, убедитесь, что вы правильно ввели название.",
	"nsfwFailedToFetchChannel": "Я не смог определить, есть ли у этого канала возрастные ограничения. Пожалуйста, повторите попытку позже.",
	"allNsfw": "Все посты из указанного сабреддита помечены как NSFW и могут отображаться только на каналах ограниченных по возрасту.",
	"allNsfl": "Все посты из указанного сабреддита помечены как NSFL, и поэтому я не могу показать вам ни одного из них.",
	"abortError": "Reddit не ответил вовремя. Пожалуйста, повторите попытку позже.",
	"unavailableErrorPrivate": "Я не смог получить никакой информации из указанного сабреддита, потому что он помечен как приватный.",
	"unavailableErrorGoldOnly": "Я не смог получить никакой информации из указанного сабреддита, потому что он доступен только для Reddit Premium.",
	"unavailableErrorQuarantined": "Я не смог получить никакой информации из указанного сабреддита, потому что он на карантине. Причина:\n>>> {{reason}}",
	"unavailableErrorGated": "Я не смог получить никакой информации из указанного сабреддита, потому что он был закрыт. Причина:\n>>> {{reason}}",
	"unavailableErrorNotFound": "Я не смог получить никакой информации из указанного сабреддита, так как его не существует.",
	"unavailableErrorBanned": "Я не смог получить никакой информации из указанного сабреддита, потому что он помечен как забаненный.",
	"unavailableForLegalReasons": "Я не смог получить никакой информации из указанного сабреддита, потому что он недоступен по юридическим причинам.",
	"unavailable": "Я не смог получить никакой информации от Reddit, потому что его сервера в настоящее время недоступны.",
	"unknownError": "Я не смог получить никакой информации из указанного сабреддита из-за неизвестной ошибки."
}
