{
	"name": "reddit",
	"description": "Получить информацию с Reddit",
	"subredditName": "сабреддит",
	"subredditDescription": "Получить случайный пост из указанного сабреддита",
	"postName": "пост",
	"postDescription": "Получить информацию о конкретном посте",
	"optionsRedditName": "reddit",
	"optionsPostName": "пост",
	"invalidName": "Названия сабреддитов должны иметь длину от 3 до 21 символа и содержать только буквы, цифры или знаки подчёркивания. Также поддерживаются префиксы `/r/` и `r/`.",
	"banned": "Указанный сабреддит не считается безопасным, пожалуйста, попробуйте другой.",
	"post": "**{{title}}** отправлен {{author}}\n{{url}}",
	"noPosts": "В указанном сабреддите нет доступных постов. Пожалуйста, убедитесь, что вы правильно ввели название.",
	"allNsfw": "Все посты из указанного сабреддита отмечены как NSFW и могут быть показаны только в каналах с возрастными ограничениями.",
	"allNsfl": "Все посты из указанного сабреддита отмечены как NSFL, поэтому я не могу показать вам ни один из них.",
	"abortError": "Reddit не ответил вовремя. Пожалуйста, повторите попытку позже.",
	"unavailableErrorPrivate": "Я не смог получить никакой информации из указанного сабреддита, потому что он отмечен как приватный.",
	"unavailableErrorGoldOnly": "Я не смог получить никакой информации из указанного сабреддита, потому что он доступен только для Reddit Premium.",
	"unavailableErrorQuarantined": "Я не смог получить никакой информации из указанного сабреддита, потому что он на карантине. Причина:\n>>> {{reason}}",
	"unavailableErrorGated": "Я не смог получить никакой информации из указанного сабреддита, потому что он закрыт. Причина:\n>>> {{reason}}",
	"unavailableErrorNotFound": "Я не смог получить никакой информации из указанного сабреддита, так как его не существует.",
	"unavailableErrorBanned": "Я не смог получить никакой информации из указанного сабреддита, потому что он отмечен как забаненный.",
	"unavailableForLegalReasons": "Я не смог получить никакой информации из указанного сабреддита, потому что он недоступен по юридическим причинам.",
	"unavailable": "Я не смог получить никакой информации с Reddit, потому что его серверы в настоящий момент недоступны.",
	"unknownError": "Я не смог получить никакой информации из указанного сабреддита из-за неизвестной ошибки."
}
